{
  "API Gateway": "AWS service that handles HTTP requests and routes them to backend services like Lambda functions",
  "Lambda": "Serverless compute service that runs code without managing servers. You write the code, AWS runs it.",
  "DynamoDB": "NoSQL database service provided by AWS. It's fast and scales automatically.",
  "S3": "Simple Storage Service - object storage in the cloud. Think of it like a file system in the cloud.",
  "Cognito": "AWS service for user authentication and authorization. Handles login, signup, and user management.",
  "JWT": "JSON Web Token - a secure way to transmit information between parties. Used for authentication.",
  "Docker": "Platform for running applications in containers. Makes it easy to run the same code everywhere.",
  "Node.js": "JavaScript runtime that lets you run JavaScript on the server side.",
  "Express": "Web framework for Node.js. Makes it easy to build APIs and web servers.",
  "REST API": "Representational State Transfer API - a way for applications to communicate over HTTP.",
  "Endpoint": "A specific URL path in an API that performs a specific function (like /auth/login).",
  "Serverless": "Architecture where you don't manage servers. AWS handles all the infrastructure.",
  "IAM": "Identity and Access Management - AWS service for managing permissions and access.",
  "CloudWatch": "AWS monitoring service. Shows logs and metrics for your applications.",
  "VPC": "Virtual Private Cloud - your own isolated network in AWS.",
  "CI/CD": "Continuous Integration/Continuous Deployment - automated testing and deployment pipeline.",
  "Git": "Version control system for tracking code changes.",
  "Pull Request": "A way to propose code changes. Others review before merging into main code.",
  "Merge": "Combining code changes from one branch into another.",
  "Branch": "A separate version of your code where you can make changes without affecting the main code.",
  "Environment Variables": "Configuration values stored outside your code (like API keys).",
  "JSON": "JavaScript Object Notation - a format for storing and exchanging data.",
  "HTTP Methods": "GET (retrieve data), POST (create data), PUT (update data), DELETE (remove data).",
  "Status Codes": "200 (success), 400 (bad request), 401 (unauthorized), 404 (not found), 500 (server error).",
  "Async/Await": "JavaScript syntax for handling asynchronous operations (like API calls).",
  "Promise": "JavaScript object representing the eventual completion of an async operation.",
  "Callback": "Function passed as an argument to another function, called when operation completes.",
  "Middleware": "Code that runs between receiving a request and sending a response.",
  "CORS": "Cross-Origin Resource Sharing - allows web apps from different domains to communicate.",
  "Authentication": "Verifying who you are (login with username/password).",
  "Authorization": "Verifying what you're allowed to do (permissions).",
  "Encryption": "Converting data into a secret code to protect it.",
  "Hash": "One-way conversion of data (like passwords) into a fixed-size string.",
  "Salt": "Random data added to passwords before hashing to make them more secure.",
  "Token": "A piece of data that proves you're authenticated (like a digital key).",
  "Session": "A way to remember user state across multiple requests.",
  "Cache": "Temporary storage of data to make future requests faster.",
  "Load Balancer": "Distributes incoming traffic across multiple servers.",
  "Scaling": "Adding more resources to handle increased traffic (horizontal: more servers, vertical: bigger servers).",
  "Deployment": "Process of releasing your code to production where users can access it.",
  "Rollback": "Reverting to a previous version of code if something goes wrong.",
  "Staging": "Environment that mimics production for testing before release.",
  "Production": "Live environment where real users access your application.",
  "Development": "Environment where developers write and test code.",
  "Bug": "An error or flaw in code that causes incorrect behavior.",
  "Debug": "Process of finding and fixing bugs in code.",
  "Refactor": "Improving code structure without changing its behavior.",
  "Technical Debt": "Future work needed due to quick/suboptimal solutions now.",
  "Sprint": "Fixed time period (usually 2 weeks) for completing a set of tasks.",
  "Standup": "Daily short meeting where team shares progress and blockers.",
  "Blocker": "Something preventing you from making progress on a task.",
  "Code Review": "Process where other developers check your code before merging.",
  "Linter": "Tool that checks code for style and potential errors.",
  "Unit Test": "Test that checks a single piece of code works correctly.",
  "Integration Test": "Test that checks multiple pieces of code work together.",
  "Mock": "Fake version of a component used in testing.",
  "Dependency": "External code/library your project needs to work.",
  "Package Manager": "Tool for installing and managing dependencies (npm, yarn).",
  "CLI": "Command Line Interface - text-based way to interact with programs.",
  "SDK": "Software Development Kit - tools and libraries for building applications.",
  "API Key": "Secret code used to authenticate with an external service.",
  "Webhook": "Automated message sent from one app to another when something happens.",
  "Rate Limiting": "Restricting how many requests a user can make in a time period.",
  "Pagination": "Breaking large data sets into smaller pages.",
  "Query Parameter": "Data passed in URL after ? (like ?page=2&limit=10).",
  "Path Parameter": "Variable part of URL path (like /users/:id).",
  "Request Body": "Data sent with POST/PUT requests.",
  "Response Body": "Data returned from an API request.",
  "Header": "Metadata sent with HTTP requests/responses.",
  "Cookie": "Small piece of data stored in browser, sent with each request.",
  "Local Storage": "Browser storage that persists even after closing browser.",
  "Session Storage": "Browser storage that clears when tab is closed."
}
